# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
your_letter = int(input('Введите номер буквы согласно таблицы ASCII: '))

print(f'Ваша буква - "{chr(your_letter)}"')
